src/Catalogs/Счета/Счета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Счета</name>
  <predefined>
    <items>
      <name>БанковскийСчет</name>
      <description>Банковский счет</description>
    </items>
    <items>
      <name>Карта</name>
      <description>Карта</description>
    </items>
    <items>
      <name>Кошелек</name>
      <description>Кошелек</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидСчета</name>
    <type>
      <types>EnumRef.ВидСчета</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ВидСчета/ВидСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидСчета</name>
  <enumValues>
    <name>Кошелек</name>
  </enumValues>
  <enumValues>
    <name>БанковскаяКарта</name>
  </enumValues>
  <enumValues>
    <name>БанковскийСчет</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Счета/Forms/ФормаЭлемента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Форма элемента справочника Счета (Wallet HTML).
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = "Счёт";
	ОбновитьHTMLНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПолеHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	КомандаПриложения = ИзвлечьКомандуИзСсылки(ДанныеСобытия.Href);
	
	Если Не ЗначениеЗаполнено(КомандаПриложения) Или КомандаПриложения = "noop" Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если КомандаПриложения = "back" Тогда
		
		Закрыть();
		
	ИначеЕсли КомандаПриложения = "name" Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаНаименования", ЭтотОбъект);
		ОбщийМодульКлиент.ПоказатьВводТекста(ОписаниеОповещения, Объект.Наименование, "Наименование", 25);
		
	ИначеЕсли КомандаПриложения = "kind" Тогда
		
		РежимВыбораВида = Истина;
		ОбновитьHTMLНаСервере();
		
	ИначеЕсли КомандаПриложения = "kind-back" Тогда
		
		РежимВыбораВида = Ложь;
		ОбновитьHTMLНаСервере();
		
	ИначеЕсли СтрНачинаетсяС(КомандаПриложения, "set-kind:") Тогда
		
		Объект.ВидСчета = ОбщийМодульСервер_СправочникиUI.ВидСчетаПоИмени(Сред(КомандаПриложения, 10));
		РежимВыбораВида = Ложь;
		ОбновитьHTMLНаСервере();
		
	ИначеЕсли КомандаПриложения = "save" Тогда
		
		ПодключитьОбработчикОжидания("ЗаписатьОтложенно", 0.05, Истина);
		
	ИначеЕсли КомандаПриложения = "delete" Тогда
		
		Если Объект.Предопределенный Тогда
			
			Возврат;
			
		КонецЕсли;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПодтвержденияУдаления", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ОбщийМодульСервер_Безопасность.ТекстПодтвержденияУдаления(Объект.Ссылка), РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВводаНаименования(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Объект.Наименование = Результат;
	ОбновитьHTMLНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодтвержденияУдаления(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если УдалитьНаСервере() Тогда
		
		Оповестить("СчетаИзменены");
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьОтложенно() Экспорт
	
	ТекстОшибки = ЗаписатьНаСервере();
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		
		ПоказатьПредупреждение(, ТекстОшибки);
		Возврат;
		
	КонецЕсли;
	
	Оповестить("СчетаИзменены");
	
	Если Открыта() Тогда
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		
		Возврат "Укажите наименование";
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ВидСчета) Тогда
		
		Возврат "Укажите вид счёта";
		
	КонецЕсли;
	
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	СправочникОбъект.Записать();
	ЗначениеВРеквизитФормы(СправочникОбъект, "Объект");
	
	Возврат "";
	
КонецФункции

&НаСервере
Функция УдалитьНаСервере()
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Объект.Ссылка.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ОбновитьHTMLНаСервере()
	
	ВидИмя = "";
	
	Если Объект.ВидСчета = Перечисления.ВидСчета.Кошелек Тогда
		
		ВидИмя = "Кошелек";
		
	ИначеЕсли Объект.ВидСчета = Перечисления.ВидСчета.БанковскаяКарта Тогда
		
		ВидИмя = "БанковскаяКарта";
		
	ИначеЕсли Объект.ВидСчета = Перечисления.ВидСчета.БанковскийСчет Тогда
		
		ВидИмя = "БанковскийСчет";
		
	КонецЕсли;
	
	Данные = Новый Структура("Наименование, ВидСчета, ВидСчетаТекст, ВидСчетаИмя, Предопределенный",
		Объект.Наименование, Объект.ВидСчета,
		ОбщийМодульСервер_СправочникиUI.ПредставлениеВидаСчета(Объект.ВидСчета), ВидИмя, Объект.Предопределенный);
	ТекстHTML = ОбщийМодульСервер_СправочникиUI.HTMLЭлементаСчета(Данные, РежимВыбораВида);
	
КонецПроцедуры

&НаКлиенте
Функция ИзвлечьКомандуИзСсылки(АдресСсылки)
	
	Если Не ЗначениеЗаполнено(АдресСсылки) Тогда
		
		Возврат "";
		
	КонецЕсли;
	
	Позиция = СтрНайти(НРег(АдресСсылки), "app:");
	
	Если Позиция = 0 Тогда
		
		Возврат "";
		
	КонецЕсли;
	
	Возврат Сред(АдресСсылки, Позиция + 4);
	
КонецФункции

#КонецОбласти
